import streamlit as st
st.set_page_config(page_title = "О проекте", page_icon="🧬")
st.title("🧬 О проекте")
st.sidebar.success(" ⬆️    Узнайте о проекте чуть больше ")

st.markdown("Добро пожаловать на наш сайт, _дорогой друг_! Если ты оказался здесь, " 
            "то это значит, что ты - уставший от учебы студент медицинского учреждения,"
            " у которого из желаний - только порция хорошего крепкого сна. Да, возможно, "
            "наш ИИ-ассистент не избавит тебя от обязанности переделать домашние задания "
            "по всем тридцати предметам, но он может значительно сократить время на поиски "
            "информации, необходимой для выполнения твоих работ.")

st.markdown("Мы опросили студентов медицинского вуза, и по результатам опроса более 40% "
            "студентов сталкиваются с ситуациями, когда им приходиться потратить на поиск "
            "информации более 10 минут _(а ведь, поискав так информацию пару раз, теряется очень много часов сна)_"
            ". Наш помощник сократит это время до 10 секунд. _Чувствуете разницу?_ 🧠")


st.markdown("Конечно, возникает закономерный вопрос: зачем нужен ИИ-помощник, если существует такая штука," 
            "как интернет или созданный нашими друзьями-китайцами DeepSeek? Ответ очень прост - **достоверность информации**. 📖")

st.markdown("Как часто Вы смотрите на источники той информации, которую Вы получили с помощью DeepSeek или "
            "с первой попавшейся ссылки из интернета? Вы можете быть уверены, что Ваш "
            "преподаватель не посмеется над Вашим ответом, полученным таким образом, "
            "и не будет потом 10 лет рассказывать про такого вот студента? А мы можем "
            "гарантировать Вам эту уверенность, ведь все ответы, которые Вы будете "
            "получать здесь, взяты из книг и учебников, по которым Вы учитесь, "
            "из научных статей и журналов, которые Вам рекомендуют к прочтению в Вашем учебном заведении.")

st.markdown("**Приятного использования, и надеемся, что наш помощник удивит Вас! 🎓**")


